nradulovic/pic32_meerkat/driver/source/lld_uart1.c
/*
 * File:    lld_uart1.h
 * Author:  nenad
 * Details: Low Level Driver for UART1
 *
 * Created on February 14, 2014, 9:59 PM
 */

/*=========================================================  INCLUDE FILES  ==*/

#include <xc.h>
#include <sys/attribs.h>

#include "driver/uart.h"
#include "driver/clock.h"
#include "plat/critical.h"
#include "vtimer/vtimer.h"

/*=========================================================  LOCAL MACRO's  ==*/

#define IEC1_U1E                        (0x1u << 7)
#define IEC1_U1RX                       (0x1u << 8)
#define IEC1_U1TX                       (0x1u << 9)

#define IFS1_U1E                        (0x1u << 7)
#define IFS1_U1RX                       (0x1u << 8)
#define IFS1_U1TX                       (0x1u << 9)

#define INTR_U1RX                       (0x1u << 8)
#define INTR_U1TX                       (0x1u << 9)

#define U1MODE_STSEL_2_STOP_BITS        (0x1u << 0)
#define U1MODE_PDSEL_9_NO               (0x3u << 1)
#define U1MODE_PDSEL_8_ODD              (0x2u << 1)
#define U1MODE_PDSEL_8_EVEN             (0x1u << 1)
#define U1MODE_EN_CTS_RTS               (0x2u << 8)
#define U1MODE_ON                       (0x1u << 15)

#define U1STA_URXDA                     (0x1u << 0)
#define U1STA_OERR                      (0x1u << 1)
#define U1STA_FERR                      (0x1u << 2)
#define U1STA_PERR                      (0x1u << 3)
#define U1STA_RXISEL_3_4                (0x2u << 6)
#define U1STA_RXISEL_1_2                (0x1u << 6)
#define U1STA_TRMT                      (0x1u << 8)
#define U1STA_UTXBF                     (0x1u << 9)
#define U1STA_TXEN                      (0x1u << 10)
#define U1STA_RXEN                      (0x1u << 12)
#define U1STA_TXISEL_ALL                (0x1u << 14)

#define U1STA_URXISEL_Msk               (0x3u << 6)

#define UART1_PIN_ADDRESS(id, value, address)                                   \
    address,

#define UART1_PIN_VALUE(id, value, address)                                     \
    value,

/*======================================================  LOCAL DATA TYPES  ==*/
/*=============================================  LOCAL FUNCTION PROTOTYPES  ==*/

static void uartUpdateRxTrigger(
    size_t);
static void lldUartOpen(
    const struct uartConfig *,
    struct uartHandle *);
static void lldUartClose(
    struct uartHandle *);
static bool lldUartIsReadBuffEmpty(
    struct uartHandle *);
static bool lldUartIsWriteBuffFull(
    struct uartHandle *);
static uint32_t lldUartRead(
    struct uartHandle *);
static void lldUartWrite(
    struct uartHandle *,
    uint32_t);
static void lldUartReadStart(
    struct uartHandle *);
static void lldUartReadCancel(
    struct uartHandle *);
static void lldUartReadStop(
    struct uartHandle *);
static void lldUartWriteStart(
    struct uartHandle *);
static void lldUartWriteStop(
    struct uartHandle *);

/*=======================================================  LOCAL VARIABLES  ==*/

static struct esVTimer          ReadAfterTimeout;
static struct uartHandle *      g_uart1_handle;
static uint32_t                 g_uart1_tx_counter;
static uint32_t                 g_uart1_rx_counter;
static bool                     g_uart1_rx_cancelled;

static volatile unsigned int * const uartPinAddress[UART1_LAST_PIN_ID] = {
    UART1_PIN_TABLE(UART1_PIN_ADDRESS)
};

static const unsigned int uartPinValue[UART1_LAST_PIN_ID] = {
    UART1_PIN_TABLE(UART1_PIN_VALUE)
};

/*======================================================  GLOBAL VARIABLES  ==*/

const struct uartId Uart1 = {
    lldUartOpen,
    lldUartClose,
    lldUartIsReadBuffEmpty,
    lldUartIsWriteBuffFull,
    lldUartRead,
    lldUartWrite,
    lldUartReadStart,
    lldUartReadCancel,
    lldUartReadStop,
    lldUartWriteStart,
    lldUartWriteStop
};

/*============================================  LOCAL FUNCTION DEFINITIONS  ==*/

static void uartUpdateRxTrigger(
    size_t              size) {

    U1STACLR = U1STA_URXISEL_Msk;

    if (size >= 6) {
        U1STASET = U1STA_RXISEL_3_4;
    } else if (size >= 4) {
        U1STASET = U1STA_RXISEL_1_2;
    }
}

static void readAfterCallback(void) {
    uartReadCancel(g_uart1_handle);
}

static void lldUartOpen(
    const struct uartConfig * config,
    struct uartHandle * handle) {

    uint32_t            brg;
    uint32_t            mode;
    uint32_t            sta;

    g_uart1_handle        = handle;
    U1MODE              = 0;
    U1STA               = 0;
    IEC1CLR             = IEC1_U1TX | IEC1_U1RX | IEC1_U1E;
    IPC8bits.U1IP       = config->isrPriority;
    IPC8bits.U1IS       = 0;
    sta                 = 0;

    if ((config->flags & UART_TX_ENABLE) != 0u) {
        sta            |= U1STA_TXEN;
    }

    if ((config->flags & UART_RX_ENABLE) != 0u) {
        sta            |= U1STA_RXEN;
    }
    sta                |= U1STA_TXISEL_ALL; /* | U1STA_RXISEL_3_4;*/
    U1STA               = sta;
    brg = clockGetPeripheralClock() / config->speed;
    brg++;
    brg >>= 4;
    brg--;
    brg &= 0xffffu;
    U1BRG               = brg;
    mode                = U1MODE_ON;

    if ((config->flags & UART_HARDWARE_FLOW) != 0u) {
        mode           |= U1MODE_EN_CTS_RTS;
        /*--  Remap CTS & RTS port pins  -------------------------------------*/
        U1CTSRbits.U1CTSR = uartPinValue[config->remap.cts];
        *uartPinAddress[config->remap.rts] = 0x01u;
    }

    if ((config->flags & UART_DATA_BITS_9) != 0u) {
        mode           |= U1MODE_PDSEL_9_NO;
    } else if ((config->flags & UART_PARITY_EVEN) != 0u) {
        mode           |= U1MODE_PDSEL_8_EVEN;
    } else if ((config->flags & UART_PARITY_ODD) != 0u) {
        mode           |= U1MODE_PDSEL_8_ODD;
    }

    if ((config->flags & UART_STOP_BITS_2) != 0u) {
        mode           |= U1MODE_STSEL_2_STOP_BITS;
    }
    /*--  Remap RX & TX port pins  -------------------------------------------*/
    *uartPinAddress[config->remap.tx]  = 0x01u;
    U1RXRbits.U1RXR     = uartPinValue[config->remap.rx];
    U1MODE              = mode;
    esVTimerInit(&ReadAfterTimeout);
}

static void lldUartClose(
    struct uartHandle * handle) {

    lldUartWriteStop(handle);
    lldUartReadStop(handle);

    while ((U1STA & U1STA_TRMT) == 0u);                                         /* Wait for last write                                      */
    U1MODECLR = U1MODE_ON;
}

static bool lldUartIsReadBuffEmpty(
    struct uartHandle * handle) {

    (void)handle;

    if ((U1STA & U1STA_URXDA) == 0u) {
        return (true);
    } else {
        return (false);
    }
}

static bool lldUartIsWriteBuffFull(
    struct uartHandle * handle) {

    (void)handle;
    
    if ((U1STA & U1STA_UTXBF) != 0u) {
        return (true);
    } else {
        return (false);
    }
}

static uint32_t lldUartRead(
    struct uartHandle * handle) {

    (void)handle;

    return (U1RXREG);
}

static void lldUartWrite(
    struct uartHandle * handle,
    uint32_t            data) {

    (void)handle;
    U1TXREG = data;
}

static void lldUartReadStart(
    struct uartHandle * handle) {

    g_uart1_rx_counter   = 0u;
    g_uart1_rx_cancelled = false;
    uartUpdateRxTrigger(0);

    if (handle->readTimeout != (uint32_t)-1)
    {
        esVTimerCancel(&ReadAfterTimeout);
    }
    U1STACLR = U1STA_OERR | U1STA_PERR;                                         /* Flush old reveived data                                  */
    IFS1CLR  = IFS1_U1RX;
    IEC1SET  = IEC1_U1RX;
}

static void lldUartReadCancel(
    struct uartHandle * handle) {

    (void)handle;

    g_uart1_rx_cancelled = true;
    IFS1SET           = IFS1_U1RX;
}

static void lldUartReadStop(
    struct uartHandle * handle) {

    (void)handle;

    IEC1CLR = IEC1_U1RX;
}

static void lldUartWriteStart(
    struct uartHandle * handle) {

    (void)handle;
    g_uart1_tx_counter = 0u;

    IFS1CLR = IFS1_U1TX;
    IEC1SET = IEC1_U1TX;
}

static void lldUartWriteStop(
    struct uartHandle * handle) {

    (void)handle;

    IEC1CLR = IEC1_U1TX;
}

/*===================================  GLOBAL PRIVATE FUNCTION DEFINITIONS  ==*/
/*====================================  GLOBAL PUBLIC FUNCTION DEFINITIONS  ==*/

/*
 * TODO: ISR supports only 8-bit data size
 */
void __ISR(_UART1_VECTOR) lldUart1Handler(void) {

    /*--  RX interrupt  ------------------------------------------------------*/
    if ((IEC1 & IFS1 & INTR_U1RX) != 0u) {
        IFS1CLR         = IFS1_U1RX;

        while ((U1STA & U1STA_URXDA) != 0u) {

            ((uint8_t *)g_uart1_handle->readBuffer)[g_uart1_rx_counter] = U1RXREG;
            g_uart1_rx_counter++;
        }

        if (g_uart1_handle->readTimeout != (uint32_t)-1)
        {
            if (g_uart1_handle->reader != NULL) {
                esVTimerCancelI(&ReadAfterTimeout);
                esVTimerStartI(&ReadAfterTimeout, g_uart1_handle->readTimeout, (esVTimerFn)readAfterCallback, NULL);
            }
        }
        
        if ((U1STA & (U1STA_OERR | U1STA_FERR | U1STA_PERR)) != 0u) {
            enum uartError error;

            if ((U1STA & U1STA_OERR) != 0u) {
                error = UART_ERROR_OVERFLOW;
            } else if ((U1STA & U1STA_FERR) != 0u) {
                error = UART_ERROR_FRAME;
            } else {
                error = UART_ERROR_PARITY;
            }
            U1STACLR = U1STA_OERR;                                              /* Flush the rest in fifo buffer                            */
            IEC1CLR  = IEC1_U1RX;
            g_uart1_handle->state &= ~UART_RX_ACTIVE;
            
            if (g_uart1_handle->reader != NULL) {
                (void)g_uart1_handle->reader(
                    g_uart1_handle,
                    error,
                    g_uart1_handle->readBuffer,
                    g_uart1_rx_counter);
            }
        } else if ((g_uart1_rx_counter >= g_uart1_handle->readSize) || (g_uart1_rx_cancelled == true)) {
            size_t          request;
            enum uartError  error;

            request = 0;
            error   = UART_ERROR_NONE;

            if (g_uart1_rx_cancelled) {
                g_uart1_rx_cancelled = false;
                error             = UART_ERROR_CANCEL;
            }
            
            if (g_uart1_handle->reader != NULL) {

                request = g_uart1_handle->reader(
                    g_uart1_handle,
                    error,
                    g_uart1_handle->readBuffer,
                    g_uart1_rx_counter);
                g_uart1_handle->readSize = request;
                uartUpdateRxTrigger(0);
            }

            if (request == 0u) {
                g_uart1_handle->state &= ~UART_RX_ACTIVE;
                IEC1CLR = IEC1_U1RX;
            }
        }
    }
    
    /*-- TX interrupt  -------------------------------------------------------*/
    if ((IEC1 & IFS1 & INTR_U1TX) != 0u) {
        IFS1CLR = IFS1_U1TX;

        while (((U1STA & U1STA_UTXBF) == 0u) &&
            g_uart1_tx_counter < g_uart1_handle->writeSize) {

            U1TXREG = ((uint8_t *)g_uart1_handle->writeBuffer)[g_uart1_tx_counter];
            g_uart1_tx_counter++;
        }
        
        if (g_uart1_tx_counter == g_uart1_handle->writeSize) {
            size_t  request;
            
            request = 0;
            
            if (g_uart1_handle->writer != NULL) {
                request = g_uart1_handle->writer(
                    g_uart1_handle,
                    UART_ERROR_NONE,
                    g_uart1_handle->writeBuffer,
                    g_uart1_handle->writeSize);
                g_uart1_handle->writeSize = request;
            }
            
            if (request == 0u) {
                g_uart1_handle->state &= ~UART_TX_ACTIVE;
                IEC1CLR = IEC1_U1TX;                                        /* Stop further transmission                                */
            }
        }
    }
}

/*================================*//** @cond *//*==  CONFIGURATION ERRORS  ==*/
/** @endcond *//** @} *//******************************************************
 * END of lld_uart1.c
 ******************************************************************************/
